//*=============================================================================
//EnemyManta.cpp
//*=============================================================================

//==============================================================================
//include
//==============================================================================
#include "EnemyManta.h"
#include <vector>
#include <fstream>


//=============================================================================
//コンストラクタ
//=============================================================================
//[input]
//	pName:データ名
//	vPos:設定する座標
//	pResFile:敵の動きのファイル
//=============================================================================
CEnemyManta::CEnemyManta( const char *pName, Math::Vector3D vPos, File::IResourceFile *pResFile )  
:CEnemy( pName, vPos, pResFile )
{
	m_TypeName = "jyq";//マンタ
	m_StTypeName = "マンタ";

	//float Scale = 15.0f;
	float Scale = 1.0f;
	
	m_vScale.Set( Scale, Scale, Scale );
	
	m_fSpeed = 2.0f;
	
	m_IsFly = true;
	
}


//=============================================================================
//初期化
//=============================================================================
void CEnemyManta::Init()
{
	CEnemy::Init();
	
	//ルートの移動キーの設定
	SetRootKey();
	
	
	m_IsLimitTime = false;
	
}

//=============================================================================
//処理
//=============================================================================
void CEnemyManta::Exec()
{
	m_vCatchPos = m_vPos + Math::Vector3D( 0, -0.5f, 0 ) + m_vFront * 1.0f;

	CEnemy::Exec();	
	
}

//=============================================================================
//移動処理
//=============================================================================
void CEnemyManta::MoveExec()
{
	MoveRoot();
}


//=============================================================================
//壁との判定
//=============================================================================
//[input]
//	pField:フィールド
//[return]
//	壁に当たっているかどうか
//=============================================================================
bool CEnemyManta::HitCheckWall( CField *pField )
{
	m_HitRay.vStart = m_vPos + Math::Vector3D( 0.0f, 3.0f, 0.0f );
	m_HitRay.vEnd = m_HitRay.vStart + m_vFront * 0.2f;
	
	Bool HitCheck = MoveCheck( pField );
	
	//通れる箇所の設定
	if( HitCheck == MASK_LAKE || HitCheck == -1 )
	{
		return false;
	}
	
	return true;
	
}



