//*============================================================================
//EnemyLizard.h
//*============================================================================
//[history]
//	08/04/15 作成
//[author]
//	Taka
//=============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "enemy.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	とかげ用クラス
//=============================================================================
class CEnemyLizard : public CEnemy
{
	private:
		
		bool m_IsWall;//壁かどうか
	
	public:
	
		//コンストラクタ
		CEnemyLizard(void);
		
		//コンストラクタ
		CEnemyLizard( const char *pName, Math::Vector3D vPos, Selene::File::IResourceFile *pResFile );
		
		//移動
		bool Move( Selene::Math::Vector3D vTargetPos, CCamera *pCam, CField *pField, bool IsShowMark );//移動
		
		
};
