//*============================================================================
//field.cpp
//*============================================================================

//=============================================================================
//include
//=============================================================================
#include "field.h"
#include "SceneManager.h"

//=============================================================================
//コンストラクタ
//=============================================================================
//[input]
//	pName:データ名
//	vPos:位置
//=============================================================================
CField::CField( const char *pName, Math::Vector3D vPos ) 
: m_pMapModel(NULL),
  m_pLine3D(NULL),
  CDraw3DObject( pName, vPos )
{
	//memset( m_pActorMap, NULL, SCREEN_MAX );
	
	for( int numActor = 0;numActor < SCREEN_MAX;++numActor )
	{
		m_pActorMap[numActor] = NULL;
	}
}


//=============================================================================
//デストラクタ
//=============================================================================
CField::~CField()
{
	for( int numActor = 0;numActor < SCREEN_MAX;++numActor )
	{
		SAFE_RELEASE( m_pActorMap[numActor] );
	}
	
	SAFE_RELEASE( m_pMapModel );
	
}

//=============================================================================
//初期化
//=============================================================================
void CField::Init()
{
	
}

//=============================================================================
//処理
//=============================================================================
void CField::Exec()
{

}

//=============================================================================
//レンダリング
//=============================================================================
void CField::Rendering(  )
{
	m_pActorMap[m_ActorIndex]->RenderingRequest();
}

//============================================================================
//ファイル読み込み
//============================================================================
//[input]
//	pRender:レンダラー用デバイス
//	pFileMgr:ファイル管理用デバイス
//===========================================================================
void CField::Load( Renderer::IRender *pRender, File::IFileManager *pFileMgr )
{
	printf("LOAD FIELD[%s]", m_strFileName.c_str() );
	
	pFileMgr->SetCurrentPath("Map");
	
	m_pMapModel = pRender->CreateMapModelFromFile( m_strFileName.c_str() );
	
	printf( "                 : -> %s\n", m_pMapModel->IsInvalid() ? "Failed" : "Succeeded" );
	
	//アクターの生成
	for( int i = 0;i < SCREEN_MAX;++i )
	{
		CreateActor( i, CCommonObject::GetSceneMgr( i )->GetSceneMgr() );
	}
	
}

//==============================================================================
//アクターの生成
//==============================================================================
//[input]
//	pSceneMgr:シーン管理デバイス
//==============================================================================
void CField::CreateActor( int index, Scene::ISceneManager *pSceneMgr )
{
	if( m_pMapModel != NULL )
	{
		m_pActorMap[index] = pSceneMgr->CreateActor( m_pMapModel );
		
		#if defined( DEBUG ) | (_DEBUG )
			
//			m_pActorMap[index]->CreateCollisionDrawPrimitive( m_pLine );
			
		#endif
	}
	
}

//=============================================================================
//アクターインデックスのセット
//=============================================================================
//[input]
//	index:設定するインデックス
//=============================================================================
void CField::SetActorIndex( int index )
{
	m_ActorIndex = index;
}

