//*============================================================================
//Mouse.h
//*============================================================================
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "Application.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	マウス用クラス
//=============================================================================
class CMouse
{
	private:
	
		static Peripheral::IMouse *m_pMouse;//マウスデバイス
		static Math::Vector2D m_vPos;//マウスの位置
		
		
	public:
	
		//コンストラクタ
		CMouse( ICore *pCore );
		
		//デストラクタ
		~CMouse();
		
	/*Get系*/
	public:
		
		/*マウスデバイスの取得*/
		static Peripheral::IMouse *GetMouse( )
		{
			return m_pMouse;
		}
		
		//マウス位置の取得
		static Math::Vector2D GetMousePos()
		{
			m_vPos.x = toF( GetMouse()->GetPosX() );
			m_vPos.y = toF( GetMouse()->GetPosY() );
			
			return m_vPos;
		}
		
};
