//*============================================================================
//SceneTutorial.h
//*============================================================================
//[history]
//	08/03/11　作成
//	08/11/02  修正
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "SceneGameMain.h"
#include "MiniMap.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	ゲームチュートリアルクラス
//=============================================================================
class CSceneGameTutorial :	public CSceneTemplate
{
	private:
	
	public:
	
		CSceneGameTutorial( string strFileName, CSceneGameMain *pGameMain );//コンストラクタ
		virtual ~CSceneGameTutorial(void);//デストラクタ
		
		/*初期化*/
		void Init( Uint32 dt );
		
		/*待機中*/
		void Idle( Uint32 dt );
		
		/*終了*/
		void End( Uint32 dt );
		
		/*レンダリング*/
		void Rendering();

		/*更新*/
		virtual eSceneState UpDate();
	
};
