//*============================================================================
//setting.h
//*============================================================================
//[history]
//	08/11/23　作成
//[author]
//	Taka
//============================================================================
#pragma once


//=============================================================================
//const
//=============================================================================
const int FRAME_RATE = 60;//フレームレート
const int SCREEN_WIDTH = 800;//スクリーンの幅
const int SCREEN_HEIGHT = 600;//スクリーンの高さ

const int MISSION_MAX = 5;//ミッションの最大数

const int BIRD_MAX = 6;//鳥の最大数
const int MOUSE_MAX = 3;//ねずみの最大数
const int MINI_CHARA_MAX = BIRD_MAX + MOUSE_MAX;//ミニマップキャラの最大数

//=============================================================================
//enum
//=============================================================================
//スクリーンタイプ
enum eScreenType
{
	SCREEN_MAIN,//メイン画面
	SCREEN_SUB,//サブ画面
	SCREEN_MAX,
};

